# Chapter 7.1 Handling Missing Data

In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
cleaned = data.dropna()

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df.iloc[:4, 1] = NA

In [24]:
df.iloc[:2, 2] = NA

In [25]:
df

          0         1         2
0 -0.227601       NaN       NaN
1  1.843811       NaN       NaN
2  0.615674       NaN  1.526078
3  0.589157       NaN -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [26]:
df.dropna()

          0         1         2
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [27]:
df.dropna(thresh = 2)

          0         1         2
2  0.615674       NaN  1.526078
3  0.589157       NaN -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

### Filling In Missing Data

In [28]:
df.fillna(0)

          0         1         2
0 -0.227601  0.000000  0.000000
1  1.843811  0.000000  0.000000
2  0.615674  0.000000  1.526078
3  0.589157  0.000000 -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [29]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.227601  0.500000  0.000000
1  1.843811  0.500000  0.000000
2  0.615674  0.500000  1.526078
3  0.589157  0.500000 -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [31]:
_ = df.fillna(0, inplace = True)

In [32]:
df

          0         1         2
0 -0.227601  0.000000  0.000000
1  1.843811  0.000000  0.000000
2  0.615674  0.000000  1.526078
3  0.589157  0.000000 -0.006524
4 -0.711524  0.827467 -0.896295
5 -0.393196  0.107877 -0.717209
6 -1.069780  0.078350 -1.398556

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))

In [34]:
df.iloc[2:, 1] = NA

In [35]:
df.iloc[4:, 2] = NA

In [36]:
df

          0         1         2
0 -0.090272  1.530516 -0.907129
1 -0.824579 -0.578002  2.145543
2  1.000975       NaN -2.045878
3 -0.469139       NaN  0.213714
4  0.570787       NaN       NaN
5  1.641667       NaN       NaN

In [37]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.090272  1.530516 -0.907129
1 -0.824579 -0.578002  2.145543
2  1.000975 -0.578002 -2.045878
3 -0.469139 -0.578002  0.213714
4  0.570787 -0.578002  0.213714
5  1.641667 -0.578002  0.213714

In [38]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.090272  1.530516 -0.907129
1 -0.824579 -0.578002  2.145543
2  1.000975 -0.578002 -2.045878
3 -0.469139 -0.578002  0.213714
4  0.570787       NaN  0.213714
5  1.641667       NaN  0.213714

In [39]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

### Removing Duplicates

In [41]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)

In [46]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [49]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [50]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [51]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [52]:
lowercased = data['food'].str.lower()

In [53]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [54]:
data['animal'] = lowercased.map(meat_to_animal)

In [55]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [56]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [57]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [58]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

In [64]:
transform = lambda x: x[:4].upper()

In [65]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [66]:
data.index = data.index.map(transform)

In [67]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [68]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [69]:
data.rename(index = {'OHIO': 'INDIANA'},
            columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [70]:
data.rename(index = {'OHIO': 'INDIANA'}, inplace = True)

In [71]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [72]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [73]:
bins = [18, 25, 35, 60, 100]

In [74]:
cats = pd.cut(ages, bins)

In [75]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [76]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [77]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [78]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [80]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [81]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [82]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [83]:
data = np.random.rand(20)

In [84]:
pd.cut(data, 4, precision = 2)

[(0.68, 0.91], (0.46, 0.68], (0.0055, 0.23], (0.46, 0.68], (0.0055, 0.23], ..., (0.46, 0.68], (0.0055, 0.23], (0.46, 0.68], (0.23, 0.46], (0.23, 0.46]]
Length: 20
Categories (4, interval[float64, right]): [(0.0055, 0.23] < (0.23, 0.46] < (0.46, 0.68] < (0.68, 0.91]]

In [85]:
data = np.random.randn(1000) #Normally distributed

In [86]:
cats = pd.qcut(data, 4) #Cut into quartiles

In [87]:
cats

[(0.638, 3.743], (-0.0119, 0.638], (0.638, 3.743], (-0.0119, 0.638], (-0.719, -0.0119], ..., (-3.274, -0.719], (-0.719, -0.0119], (-0.719, -0.0119], (-0.719, -0.0119], (-0.0119, 0.638]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.274, -0.719] < (-0.719, -0.0119] < (-0.0119, 0.638] < (0.638, 3.743]]

In [88]:
pd.value_counts(cats)

(-3.274, -0.719]     250
(-0.719, -0.0119]    250
(-0.0119, 0.638]     250
(0.638, 3.743]       250
dtype: int64

In [89]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0119, 1.257], (-0.0119, 1.257], (-0.0119, 1.257], (-0.0119, 1.257], (-1.26, -0.0119], ..., (-1.26, -0.0119], (-1.26, -0.0119], (-1.26, -0.0119], (-1.26, -0.0119], (-0.0119, 1.257]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.274, -1.26] < (-1.26, -0.0119] < (-0.0119, 1.257] < (1.257, 3.743]]

### Detecting and Filtering Outliers

In [90]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.000009    -0.001675     0.017709    -0.025296
std       1.009720     1.013975     1.038194     1.015664
min      -3.186222    -3.064644    -3.533066    -3.332727
25%      -0.704876    -0.670956    -0.666879    -0.719454
50%       0.006781     0.041860     0.007258    -0.063146
75%       0.717446     0.683939     0.700744     0.671139
max       2.859630     2.702080     4.039626     2.817828

In [92]:
col = data[2]

In [93]:
col[np.abs(col) > 3]

55     4.039626
75     3.052559
152    3.513119
250    3.046346
323   -3.194924
632   -3.533066
782    3.335847
Name: 2, dtype: float64

In [94]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
42   0.058137  0.028146  1.156546 -3.299790
55   1.622723  0.397454  4.039626  0.279391
75   0.236768 -0.074333  3.052559  2.579851
152  0.020383  1.241936  3.513119 -0.550978
250  0.233265  1.251768  3.046346  1.056428
269  0.936800 -3.064644  0.760201  1.418720
323  0.556925 -1.477395 -3.194924 -1.419232
632  2.042373  1.125307 -3.533066 -0.216261
782 -0.475786  1.783981  3.335847  1.013569
801  1.438061 -3.004407 -0.240439  1.002884
886  0.239204  0.307335 -0.892273 -3.332727
892 -3.186222 -0.962446 -0.539416 -1.808232

In [95]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [96]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000177    -0.001606     0.016449    -0.024664
std       1.009148     1.013768     1.029464     1.013709
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.704876    -0.670956    -0.666879    -0.719454
50%       0.006781     0.041860     0.007258    -0.063146
75%       0.717446     0.683939     0.700744     0.671139
max       2.859630     2.702080     3.000000     2.817828

In [97]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling

In [98]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [100]:
sampler = np.random.permutation(5)

In [101]:
sampler

array([1, 0, 4, 2, 3])

In [102]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [103]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15

In [104]:
df.sample(n = 3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [105]:
choices = pd.Series([5, 7, -1, 6, 4])

In [106]:
draws = choices.sample(n = 10, replace = True)

In [107]:
draws

4    4
3    6
4    4
4    4
3    6
3    6
0    5
2   -1
2   -1
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [108]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [109]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [110]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [111]:
df_with_dummy = df[['data1']].join(dummies)

In [112]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [113]:
mnames = ['movie_id', 'title', 'genres']

In [114]:
movies = pd.read_table('datasets/movielens/movies.dat', sep = '::',
                       header = None, names = mnames)

/var/folders/7j/9ssbljln6_q6p_x1_dwt02500000gp/T/ipykernel_95595/1026204984.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep = '::',

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [115]:
movies[:10]

NameError: name 'movies' is not defined

In [ ]:
all_genres = []

In [ ]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [ ]:
genres = pd.unique(all_genres)

In [ ]:
genres

In [ ]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [ ]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [ ]:
gen = movies.genres[0]

In [ ]:
gen.split('|')

In [ ]:
dummies.columns.get_indexer(gen.split('|'))

In [ ]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [ ]:
movies_windic.iloc[0]

In [116]:
np.random.seed(12345)

In [117]:
values = np.random.rand(10)

In [118]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [119]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [120]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

### String Object Methods